intern-prompt/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application        simpleFoam;
startFrom          startTime;
startTime          0;
stopAt             endTime;
endTime            150;
deltaT             1;
writeControl       timeStep;
writeInterval      50;
purgeWrite         1;
writeFormat        ascii;
writePrecision     6;
writeCompression   off;
timeFormat         general;
timePrecision      6;

functions
{
    #include lines
    #includeFunc residuals
}
 

// ************************************************************************* //
