intern-prompt/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default               steadyState;
}
 
gradSchemes
{
    default              cellLimited Gauss linear 1;
}
 
divSchemes
{
    default               none;
    div(phi,U)            bounded Gauss upwind;
    div(phi,K)            bounded Gauss upwind;
    div(phi,h)            bounded Gauss upwind;
    div(phi,k)            bounded Gauss upwind;
    div(phi,epsilon)      bounded Gauss upwind;
    div(phi,omega)        bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))  Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U)))))  Gauss linear;
    div(div(phi,U))       Gauss linear;
}
 
laplacianSchemes
{
    default               Gauss linear limited 0.5;
}
 
interpolationSchemes
{
    default            linear;
}
 
snGradSchemes
{
    default            limited 0.5;
}
 
wallDist
{
    method              meshWave;
}
 

// ************************************************************************* //
