intern-prompt/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
        minIter         3;
        maxIter         100;
    }
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
        minIter         3;
        maxIter         100;
    }
    k
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
        minIter         1;
        maxIter         100;
    }
    epsilon
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
        minIter         1;
        maxIter         100;
    }
}
 
SIMPLE
{
    pRefCell  0;
    pRefValue 0;
    nNonOrthogonalCorrectors 0;
    consistent               yes;
    residualControl
    {
        p    1.0e-02;
        U    1.0e-02;
        k    1.0e-02;
        epsilon    1.0e-02;
    }
}
 
relaxationFactors
{
    fields
    {
        p    0.30;
        U    0.70;
        k    0.70;
        epsilon    0.70;
    }
    equations
    {
        p    0.90;
        U    0.90;
        k    0.90;
        epsilon    0.90;
    }
}
 

// ************************************************************************* //
