intern-prompt/system/lines
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.
\*---------------------------------------------------------------------------*/

line_1
{
    start   (1.03175 0.0000 0.0755);
    end     (1.03175 0.1143 0.0755);
    fields  (U);
    
    interpolationScheme cellPoint;
    setFormat   csv;
    
    setConfig
    {
        type    uniform;
        axis    distance;
        nPoints 100;
    }
    
    type            sets;
    libs            ("libsampling.so");
    writeControl    writeTime;
    
    sets
    (
        line
        {
            $setConfig;
            start $start;
            end   $end;
        }
    );
}
 

// ************************************************************************* //
