intern-prompt/system/residuals
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
-------------------------------------------------------------------------------
Description
    Logs residual L2 norms for specified fields to monitor convergence history
\*---------------------------------------------------------------------------*/

type                  solverInfo;
libs                  ("libutilityFunctionObjects.so");

writeControl          timeStep;
writeInterval         1;

fields                (p k U epsilon);
writeResidualFields   no;

// ************************************************************************* //
