intern-prompt/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    inlet
    {
        type triSurfaceMesh;
        file "inlet.stl";
    }
    outlet
    {
        type triSurfaceMesh;
        file "outlet.stl";
    }
    walls
    {
        type triSurfaceMesh;
        file "walls.stl";
    }
}
 
castellatedMeshControls
{
    maxLocalCells  100000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 2;
    features
    (
        
        {
            file "inlet.eMesh";
            level 0;
        }
        
        {
            file "outlet.eMesh";
            level 0;
        }
        
        {
            file "walls.eMesh";
            level 1;
        }
    );
    refinementSurfaces
    {
        inlet
        {
            level (0 0);
            patchInfo
            {
                type patch;
            }
        }
        outlet
        {
            level (0 0);
            patchInfo
            {
                type patch;
            }
        }
        walls
        {
            level (1 1);
            patchInfo
            {
                type wall;
            }
        }
    }
    resolveFeatureAngle 30;
    refinementRegions
    {
    }
    locationInMesh (0.000012 0.063500 0.075500);
    allowFreeStandingZoneFaces false;
}
 
snapControls
{
    nSmoothPatch 3;
    nSmoothInternal 5;
    tolerance 2.0;
    nSolveIter 200;
    nRelaxIter 10;
    nFeatureSnapIter 20;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
}
 
addLayersControls
{
    relativeSizes true;
    expansionRatio 1.1;
    finalLayerThickness 0.2;
    minThickness 0.00001;
    
    layers
    {
    }
    
    maxThicknessToMedialRatio 1.0;
    minMedialAxisAngle 90;
    nGrow 0;
    featureAngle 130;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}
 
meshQualityControls
{
    maxNonOrtho     65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    minVol          1e-13;
    minTetQuality   1e-15;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.05;
    minVolRatio     0.01;
    minTriangleTwist -1;
    nSmoothScale    4;
    errorReduction  0.75;
}
 
writeFlags
(
    scalarLevels
    layerSets
    layerFields
);
 
mergeTolerance 1e-6;

// ************************************************************************* //
