intern-prompt/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeatureExtractDict;
}
 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    
    subsetFeatures
    {
        nonManifoldEdges       no;
        openEdges       yes;
    }
    writeObj            yes;
}
 
outlet.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    
    subsetFeatures
    {
        nonManifoldEdges       no;
        openEdges       yes;
    }
    writeObj            yes;
}
 
walls.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    
    subsetFeatures
    {
        nonManifoldEdges       no;
        openEdges       yes;
    }
    writeObj            yes;
}
 

// ************************************************************************* //
